package shop;

/*
    1. Продукт (название, код, цена)
    2. Продукт на складе (Продукт, кол-во)
    3. Ассортимент продуктов (склад в магазине)
    4. Продукт в корзине (Продукт, кол-во)
    5. Корзина

    Реализовать:
    1. Работа с товарами
    2. Работа со складом
    3. Проверка есть ли товар на складе,
        и если есть, то хватает ли его для покупки,
        и если хватает - положить в корзину
    4. Выписать чек
 */

public class App {
    public static void main(String[] args) {
        /*
        ToDo Написать код для проверки работы нашего магазина
        1. Создать сами товары
        2. Наполнить склад (предварительно его создав) товарами
        3. Создать корзину с привязкой к складу
        4. Наполнить корзину товарами
        5. Распечатать чек покупки
         */
    }
}
